Tekla Open API Reference for Tekla Structures 2025
AnalysisPartBarAttributes Class
 The AnalysisPartBarAttributes class contains information related to analysis part bar attributes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisPartBarAttributes
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisPartBarAttributes
Public NotInheritable Class AnalysisPartBarAttributes
The AnalysisPartBarAttributes type exposes the following members.
Constructors
Name | Description
AnalysisPartBarAttributes
Initializes a new instance of the AnalysisPartBarAttributes class
Top
Properties
Name | Description
BarEndCondition
 The bar end condition.
BarStartCondition
 The bar start condition.
BarStartNumber
 The start number of the bar.
ForceStraightSegments
 The straight force segments.
MemberStartNumber
 The start number of the member.
OverrideProfileName
 The override profile name.
SplitDistances
 The split distances.
SplitNodeCount
 The count of the split node.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace